NNNCCF/STM32F103C8T6_Freertos/HARDWARE/ATK_MS6050/eMPL/inv_mpu.c
    if (st.chip_cfg.cache.dmp_on)
        mpu_set_dmp_state(1);

#ifdef MPU6500
    /* Disable motion interrupt (MPU6500 version). */
    data[0] = 0;
    if (i2c_write(st.hw->addr, st.reg->accel_intel, 1, data))
        goto lp_int_restore;
#endif

    st.chip_cfg.int_motion_only = 0;
    return 0;
}

/**
 *  @}
 */

/* ATK-MS6050的陀螺仪方向设置参数 */
static signed char gyro_orientation[9] = { 1, 0, 0,
                                           0, 1, 0,
                                           0, 0, 1};

static float atk_ms6050_clamp_unit(float value)
{
    if (value > 1.0f)
    {
        return 1.0f;
    }

    if (value < -1.0f)
    {
        return -1.0f;
    }

    return value;
}

/**
 * @brief       函数inv_orientation_matrix_to_scalar()的辅助函数
 * @param       row: 输入
 * @retval      输出
 */
static unsigned short inv_row_2_scale(const signed char *row)
{
    unsigned short b;
    
    if (row[0] > 0)
        b = 0;
    else if (row[0] < 0)
        b = 4;
    else if (row[1] > 0)
        b = 1;
    else if (row[1] < 0)
        b = 5;
    else if (row[2] > 0)
        b = 2;
    else if (row[2] < 0)
        b = 6;
    else
        b = 7;      // error
    
    return b;
}

/**
 * @brief       将方向矩阵转换为标量表示，以供DMP使用
 * @param       mtx: 方向矩阵
 * @retval      标量表示的方向参数
 */
static unsigned short inv_orientation_matrix_to_scalar(const signed char *mtx)
{
    unsigned short scalar;
    
    /*
       XYZ  010_001_000 Identity Matrix
       XZY  001_010_000
       YXZ  010_000_001
       YZX  000_010_001
       ZXY  001_000_010
       ZYX  000_001_010
     */
    
    scalar = inv_row_2_scale(mtx);
    scalar |= inv_row_2_scale(mtx + 3) << 3;
    scalar |= inv_row_2_scale(mtx + 6) << 6;
    
    return scalar;
}

/**
 * @brief       ATK-MS6050 DMP初始化
 * @param       无
 * @retval      0: 函数执行成功
 *              1: 函数执行失败
 */
uint8_t atk_ms6050_dmp_init(void)
{
    uint8_t ret;

    atk_ms6050_board_init();
    atk_ms6050_iic_init();
    g_atk_ms6050_last_init_step = 1;

    ret = atk_ms6050_device_check();
    if (ret != ATK_MS6050_EOK)
    {
        return ret;
    }

    g_atk_ms6050_last_init_step = 2;
    if (mpu_init(NULL) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 3;
    if (mpu_set_sensors(INV_XYZ_GYRO | INV_XYZ_ACCEL) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 4;
    if (mpu_configure_fifo(INV_XYZ_GYRO | INV_XYZ_ACCEL) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 5;
    if (mpu_set_sample_rate(DEFAULT_MPU_HZ) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 6;
    if (dmp_load_motion_driver_firmware() != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 7;
    if (dmp_set_orientation(inv_orientation_matrix_to_scalar(gyro_orientation)) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 8;
    if (dmp_enable_feature(DMP_FEATURE_6X_LP_QUAT |
                           DMP_FEATURE_SEND_RAW_ACCEL |
                           DMP_FEATURE_SEND_CAL_GYRO |
                           DMP_FEATURE_GYRO_CAL) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 9;
    if (dmp_set_fifo_rate(DEFAULT_MPU_HZ) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 10;
    if (mpu_set_int_level(1) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 11;
    if (mpu_set_int_latched(0) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 12;
    if (mpu_set_dmp_state(1) != 0)
    {
        return ATK_MS6050_EDMP;
    }

    g_atk_ms6050_last_init_step = 13;
    if (atk_ms6050_run_self_test() != 0)
    {
        return ATK_MS6050_ESELFTEST;
    }

    g_atk_ms6050_last_init_step = 0;
    return ATK_MS6050_EOK;
}

/**
 * @brief       获取毫秒单位的时间戳
 * @param       count: 以毫秒为单位的时间戳
 * @retval      0: 函数执行成功
 *              1: 函数执行失败
 */
int atk_ms6050_get_clock_ms(unsigned long *count)
{
    if (!count)
    {
        return 1;
    }

#if SYSTEM_SUPPORT_OS
    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED)
    {
        count[0] = ((unsigned long)xTaskGetTickCount() * 1000UL) / configTICK_RATE_HZ;
        return 0;
    }
#endif

    count[0] = 0;
    return 0;
}

uint8_t atk_ms6050_get_last_init_step(void)
{
    return g_atk_ms6050_last_init_step;
}

uint8_t atk_ms6050_get_last_mpu_init_substep(void)
{
    return g_atk_ms6050_last_mpu_init_substep;
}

uint8_t atk_ms6050_get_last_mpu6500_rev(void)
{
    return g_atk_ms6050_last_mpu6500_rev;
}

uint8_t atk_ms6050_get_last_fifo_step(void)
{
    return g_atk_ms6050_last_fifo_step;
}

uint8_t atk_ms6050_get_last_fifo_reset_step(void)
{
    return g_atk_ms6050_last_fifo_reset_step;
}

/**
 * @brief       ATK-MS6050传感器自测试函数
 * @param       无
 * @retval      0: 函数执行成功
 *              1: 函数执行失败
 */
uint8_t atk_ms6050_run_self_test(void)
{
    int result;
    long gyro[3], accel[3];

    result = mpu_run_self_test(gyro, accel);
    if ((result & 0x03) == 0x03)
    {
        /* Test passed. We can trust the gyro data here, so let's push it down
         * to the DMP.
         */
        float sens;
        unsigned short accel_sens;
        
        mpu_get_gyro_sens(&sens);
        gyro[0] = (long)(gyro[0] * sens);
        gyro[1] = (long)(gyro[1] * sens);
        gyro[2] = (long)(gyro[2] * sens);
        dmp_set_gyro_bias(gyro);
        mpu_get_accel_sens(&accel_sens);
        accel[0] *= accel_sens;
        accel[1] *= accel_sens;
        accel[2] *= accel_sens;
        dmp_set_accel_bias(accel);
        
        return 0;
    }
    else
    {
        return 1;
    }
}

/**
 * @brief       获取ATK-MS6050 DMP处理后的数据
 * @note        获取数据的频率需与宏DEFAULT_MPU_HZ定义的频率一致，
 *              获取太快，可能因ATK-MS6050还未进行数据采样，导致FIFO中无数据，从而获取失败，
 *              获取太慢，可能无法及时读出ATK-MS6050 FIFO中的数据，导致FIFO溢出，从而获取失败
 * @param       pitch: 俯仰角（精度: 0.1° 范围:  -90.0° <--->  +90.0°）
 *              roll : 横滚角（精度: 0.1° 范围: -180.0° <---> +180.0°）
 *              yaw  : 航向角（精度: 0.1° 范围: -180.0° <---> +180.0°）
 * @retval      0: 函数执行成功
 *              1: 函数执行失败
 */
uint8_t atk_ms6050_dmp_get_data(float *pitch, float *roll, float *yaw)
{
    float q0 = 0.0f;
    float q1 = 0.0f;
    float q2 = 0.0f;
    float q3 = 0.0f;
    float sin_pitch;
    short gyro[3], accel[3], sensors;
    unsigned long sensor_timestamp;
    unsigned char more;
    long quat[4];
    uint8_t first_packet = 1;

    if ((pitch == 0) || (roll == 0) || (yaw == 0))
    {
        return 1;
    }

    /* 读取ATK-MS6050 FIFO中数据的频率需与宏DEFAULT_MPU_HZ定义的频率一直
     * 读取得太快或太慢都可能导致读取失败
     * 读取太快：ATK-MS6050还未采样，FIFO中无数据，读取失败
     * 读取太慢：ATK-MS6050的FIFO溢出，读取失败
     */
    do
    {
        if (dmp_read_fifo(gyro, accel, quat, &sensor_timestamp, &sensors, &more) != 0)
        {
            if (first_packet != 0)
            {
                return 1;
            }

            break;
        }

        first_packet = 0;
    } while (more != 0);
    
    if (sensors & INV_WXYZ_QUAT)
    {
        /* ATK-MS6050的DMP输出的是姿态解算后的四元数，
         * 采用q30格式，即结果被放大了2的30次方倍，
         * 因为四元数并不是角度信号，因此为了得到欧拉角，
         * 就需要对ATK-MS6050的DMP输出结果进行转换
         */
        q0 = quat[0] / q30;
        q1 = quat[1] / q30;
        q2 = quat[2] / q30;
        q3 = quat[3] / q30;

        /* 计算俯仰角、横滚角、航向角
         * 57.3为弧度转角度的转换系数，即180/PI
         */
        sin_pitch = atk_ms6050_clamp_unit((-2.0f * q1 * q3) + (2.0f * q0 * q2));
        *pitch = asinf(sin_pitch) * 57.2957795f;
        *roll = atan2f((2.0f * q2 * q3) + (2.0f * q0 * q1),
                       (-2.0f * q1 * q1) - (2.0f * q2 * q2) + 1.0f) * 57.2957795f;
        *yaw = atan2f(2.0f * (q1 * q2 + q0 * q3),
                      q0 * q0 + q1 * q1 - q2 * q2 - q3 * q3) * 57.2957795f;
    }
    else
    {
        return 1;
    }
    
    return 0;
}

